========================================
Brace Expansion - empty
========================================

{,}
{,,,}
{,,,,,}

---

(program
    (command
        name: (brace_expansion))
    (command
        name: (brace_expansion))
    (command
        name: (brace_expansion)))

========================================
Brace Expansion - missing comma
========================================

{a}
{}

---

(program
    (command
        name: (brace_expansion
            (variable_name)
            (MISSING ",")))
    (command
        name: (brace_expansion
            (MISSING ","))))

========================================
Brace Expansion - single value
========================================

{name,}
{,name}
{,name,}
{,,,name,}
{,,,name,,,,,}

---

(program
    (command
        name: (brace_expansion (variable_name)))
    (command
        name: (brace_expansion (variable_name)))
    (command
        name: (brace_expansion (variable_name)))
    (command
        name: (brace_expansion (variable_name)))
    (command
        name: (brace_expansion (variable_name))))

========================================
Brace Expansion - with escapes
========================================

{\ ,\'}
{t\ est,}
{,,'lit\'eral',}

---

(program
    (command
        name: (brace_expansion
            (escape_sequence)
            (escape_sequence)))
    (command
        name: (brace_expansion
            (concatenation
                (variable_name)
                (escape_sequence)
                (variable_name))))
    (command
        name: (brace_expansion
                (single_quote_string (escape_sequence)))))

========================================
Brace Expansion - with variable_expansion
========================================

{,$PATH}
{,$PATH[1]}
{\$PATH,$env}
{$$ref,$arr}

---

(program
    (command
        name: (brace_expansion
            (variable_expansion (variable_name))))
    (command
        name: (brace_expansion
            (concatenation
                (variable_expansion (variable_name))
                (list_element_access
                    (index (integer))))))
    (command
        name: (brace_expansion
            (concatenation (escape_sequence) (variable_name))
            (variable_expansion (variable_name))))
    (command
        name: (brace_expansion
            (variable_expansion (variable_name))
            (variable_expansion (variable_name)))))

========================================
Brace Expansion - with otherwise special characters
========================================

{<,>,~,#}
{^,&}
{|,;}

---

(program
    (command
        name: (brace_expansion
            (word) (word) (word) (word)))
    (command
        name: (brace_expansion (word) (word)))
    (command
        name: (brace_expansion (word) (word))))

========================================
Brace Expansion - with around string concat
========================================

{a,b}c
$PATH{a,b}c

---

(program
    (command
        name: (concatenation
            (brace_expansion (variable_name) (variable_name))
            (variable_name)))
    (command
        name: (concatenation
            (variable_expansion (variable_name))
            (brace_expansion (variable_name) (variable_name))
            (variable_name))))

========================================
Brace Expansion - proper distinction between vars and words
========================================

{a+b,b}

---

(program
    (command
        name: (brace_expansion (word) (variable_name))))


========================================
Brace Expansion - requires comma between expressions
========================================

{,b b}

---

(program
    (command
        name: (brace_expansion (variable_name) (ERROR (UNEXPECTED '}')))))

========================================
Brace Expansion - expanded single var
========================================

{$PATH}

---

(program
    (command
        name: (brace_expansion
            (variable_expansion (variable_name)))))

========================================
Brace Expansion - with glob
========================================

{,*}
{,*/**/*.test}.ts

---

(program
    (command
        name: (brace_expansion (glob)))
    (command
        name: (concatenation
            (brace_expansion
                (concatenation
                    (glob) (word) (glob) (word) (glob) (word)))
            (word))))
